## Q1

In [1]:
import pandas as pd

In [2]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2

In [4]:
variable = [23,27,45,67,78,89,100]
pd.Series(variable)

0     23
1     27
2     45
3     67
4     78
5     89
6    100
dtype: int64

## Q3

In [5]:
data=  [
    {"Name":"Alice","Age":25,"Gender":"Female"},
    {"Name":"Bob","Age":30,"Gender":"Male"},
    {"Name":"Claire","Age":27,"Gender":"Female"}
]

In [6]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4

A DataFrame is a two-dimensional, size-mutable, and highly flexible data structure that is designed to store and manipulate tabular data, similar to a spreadsheet or a SQL table.


A DataFrame is a table of data with rows and columns, where each column can have a different data type.
On the other hand, a Pandas Series is a one-dimensional labeled array that can store data of any data type.

Data Frame Example:

In [7]:
data=  [
    {"Name":"Alice","Age":25,"Gender":"Female","city":"Mumbai"},
    {"Name":"Bob","Age":30,"Gender":"Male","city":"Bengaluru"},
    {"Name":"Claire","Age":27,"Gender":"Female","city":"Hyderabad"}
]

In [8]:
df4 = pd.DataFrame(data)

In [9]:
df4

     Name  Age  Gender       city
0   Alice   25  Female     Mumbai
1     Bob   30    Male  Bengaluru
2  Claire   27  Female  Hyderabad

In [12]:
type(df4)

pandas.core.frame.DataFrame

Series Example:

In [13]:
df4["city"]

0       Mumbai
1    Bengaluru
2    Hyderabad
Name: city, dtype: object

In [14]:
type(df4["city"])

pandas.core.series.Series

## Q5

1. Selecting Columns

In [16]:
df4["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

2. Sorting Data

In [18]:
sorted_data = df4.sort_values("Age")

In [19]:
sorted_data

     Name  Age  Gender       city
0   Alice   25  Female     Mumbai
2  Claire   27  Female  Hyderabad
1     Bob   30    Male  Bengaluru

## Q6

In Pandas, both Series and DataFrame are mutable.


Series: A Pandas Series is mutable, which means you can modify its values, add new values, or change the index labels.

In [21]:
data1 = pd.Series([1,2,3,4,5])
data1[0] = 100

In [22]:
data1

0    100
1      2
2      3
3      4
4      5
dtype: int64

DataFrame: A Pandas DataFrame is also mutable. You can modify its columns, add new columns, and change values within it.

In [24]:
data2 = {"A":[11,12,13],"B":[21,22,23],"C":[45,34,67]}
df2 = pd.DataFrame(data2)

In [25]:
df2

    A   B   C
0  11  21  45
1  12  22  34
2  13  23  67

In [26]:
df2["D"] = [67,90,89]

In [27]:
df2

    A   B   C   D
0  11  21  45  67
1  12  22  34  90
2  13  23  67  89

## Q7

In [31]:
name = pd.Series(["Alex","Bob","Charlie"])
age = pd.Series([21,22,23])
city = pd.Series(["Singapore","America","London"])

In [32]:
data = {"Name":name,"Age":age,"City":city}
df2 = pd.DataFrame(data)

In [33]:
df2

      Name  Age       City
0     Alex   21  Singapore
1      Bob   22    America
2  Charlie   23     London